In [2]:
import pandas as pd

# Cargar los archivos CSV proporcionados
merchant_df = pd.read_csv('./merchant.csv')
merchant_category_df = pd.read_csv('./merchant_category.csv')
card_holder_df = pd.read_csv('./card_holder.csv')
credit_card_df = pd.read_csv('./credit_card.csv')
transaction_df = pd.read_csv('./transaction.csv')

In [3]:

merchant_df.head()

   id                          name  id_merchant_category
0   1      Murphy, Heath and Fields                     1
1   2                   Riggs-Adams                     1
2   3  Sanders, Parks and Mcfarland                     2
3   4                Mccarty-Thomas                     3
4   5                Miller-Blevins                     4

In [4]:
merchant_category_df.head()

   id         name
0   1   restaurant
1   2  coffee shop
2   3          bar
3   4          pub
4   5   food truck

In [5]:
card_holder_df.head()

   id              name
0   1    Robert Johnson
1   2     Shane Shaffer
2   3  Elizabeth Sawyer
3   4    Danielle Green
4   5       Sara Cooper

In [6]:
credit_card_df.head()

                  card  cardholder_id
0     3517111172421930              1
1  4761049645711555811              1
2  4866761290278198714              2
3         675911140852              2
4       30078299053512              3

In [7]:
transaction_df.head()

     id                 date  amount              card  id_merchant
0   222  2018-01-01 21:35:10    6.22  3561954487988605           69
1  2045  2018-01-01 21:43:12    3.83  5135837688671496           85
2   395  2018-01-01 22:41:21    9.61   213193946980303           82
3  3309  2018-01-01 23:13:30   19.03  4263694062533017            5
4   567  2018-01-01 23:15:10    2.95     4498002758300           64

In [8]:
#Verificar que que todos los propietarios de tarjetas de credito realmente existan
#We make sure there are no holderes that doesn't exist
mask = credit_card_df["cardholder_id"].isin(card_holder_df["id"])

credit_card_df[~mask]

Empty DataFrame
Columns: [card, cardholder_id]
Index: []

In [9]:
#Verificamos que no haya categorias no existentes
#We make sure there are no categories wich key doen't exist
mask = merchant_df['id_merchant_category'].isin(merchant_df['id'])

merchant_df[~mask]

Empty DataFrame
Columns: [id, name, id_merchant_category]
Index: []

In [10]:
#Verificamos que las tarjetas en las transacciones existen creando una mascara
#Here we check if all the cards in the transactions exist by creating a mask
mask = transaction_df["card"].isin(credit_card_df["card"])

transaction_df[~mask]

Empty DataFrame
Columns: [id, date, amount, card, id_merchant]
Index: []

In [11]:
#los registros de las cartas aparentemente esta en el formato correspondiente y ya sabemos que no hay nulos
#the card ins the transaction is aparently in the right format and we already cjeck there are no null values
transaction_df.head()

     id                 date  amount              card  id_merchant
0   222  2018-01-01 21:35:10    6.22  3561954487988605           69
1  2045  2018-01-01 21:43:12    3.83  5135837688671496           85
2   395  2018-01-01 22:41:21    9.61   213193946980303           82
3  3309  2018-01-01 23:13:30   19.03  4263694062533017            5
4   567  2018-01-01 23:15:10    2.95     4498002758300           64

In [12]:
#Transofrmamos las tarjetas en ambas tablas a string por recomendacion del auditor
transaction_df["card"]

0          3561954487988605
1          5135837688671496
2           213193946980303
3          4263694062533017
4             4498002758300
               ...
3495    4723783028106084756
3496    4165305432349489280
3497       5361779664174555
3498       4188164051171486
3499    4723783028106084756
Name: card, Length: 3500, dtype: int64

In [13]:
#con los registros en la credit card un problema y es que esta en notacion cientifica
#here we can see that the card is in scientific notation
credit_card_df.head()

                  card  cardholder_id
0     3517111172421930              1
1  4761049645711555811              1
2  4866761290278198714              2
3         675911140852              2
4       30078299053512              3

In [92]:
#Confirmando el data type vemos que esta en un float64 lo cual difiere con el 
#formato en de las trasnacciones ya que deben ser exactamente iguales

#if we look at the data type we'll see that is in float64 a diferent format
#from the transactions and this shoultnt be since as FK they must be equal
credit_card_df["card"].dtype

dtype('int64')

In [93]:
''' 
EL hecho de que las tarjetas esten en notacion cientifica es un
problema no solo por que difieren el dato de origen y el FK sino
por que la notacion cientifica es un aproximado a un numero no
el numero entero por lo que si lo convertimos a tipo int seguira 
sin haber coincidencias por que rellenara los espacios faltantes
con ceros en lugar de los numeros correspondientes

Como solucion si estos datos fueron extraidos de una db podriamso rastrear mediante 
'''

' \nEL hecho de que las tarjetas esten en notacion cientifica es un\nproblema no solo por que difieren el dato de origen y el FK sino\npor que la notacion cientifica es un aproximado a un numero no\nel numero entero por lo que si lo convertimos a tipo int seguira \nsin haber coincidencias por que rellenara los espacios faltantes\ncon ceros en lugar de los numeros correspondientes\n\nComo solucion si estos datos fueron extraidos de una db podriamso rastrear mediante \n'

In [ ]:
#Verificamos si hay duplicados
#We Check for duplicates

In [97]:
credit_card_df[credit_card_df.duplicated()]

Empty DataFrame
Columns: [card, cardholder_id]
Index: []

In [98]:

card_holder_df[card_holder_df.duplicated()]

Empty DataFrame
Columns: [id, name]
Index: []

In [99]:
merchant_category_df[card_holder_df.duplicated()]

C:\Users\sebas\AppData\Local\Temp\ipykernel_14764\3221593387.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  merchant_category_df[card_holder_df.duplicated()]

Empty DataFrame
Columns: [id, name]
Index: []

In [100]:
merchant_df[merchant_df.duplicated()]

Empty DataFrame
Columns: [id, name, id_merchant_category]
Index: []

In [79]:
transaction_df[transaction_df.duplicated()]

Empty DataFrame
Columns: [id, day, hour, amount, card, id_merchant]
Index: []

In [ ]:
#Verificamos si hay nulos y los datos de las columnas
#CHeck if there are null values an the data type

In [71]:
card_holder_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      25 non-null     int64
 1   name    25 non-null     object
dtypes: int64(1), object(1)
memory usage: 532.0+ bytes

In [72]:
merchant_category_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      5 non-null      int64
 1   name    5 non-null      object
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [73]:
merchant_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    150 non-null    int64
 1   name                  150 non-null    object
 2   id_merchant_category  150 non-null    int64
dtypes: int64(2), object(1)
memory usage: 3.6+ KB

In [ ]:
credit_card_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   card           53 non-null     int64
 1   cardholder_id  53 non-null     int64
dtypes: int64(2)
memory usage: 980.0 bytes

In [ ]:
transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3500 entries, 0 to 3499
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           3500 non-null   int64
 1   day          3500 non-null   object
 2   hour         3500 non-null   object
 3   amount       3500 non-null   float64
 4   card         3500 non-null   float64
 5   id_merchant  3500 non-null   int64
dtypes: float64(2), int64(2), object(2)
memory usage: 164.2+ KB

In [14]:
transaction_df["date"] = pd.to_datetime(transaction_df["date"])

In [15]:
transaction_df.insert(1,"hour",transaction_df["date"].dt.time)
transaction_df.insert(1,"day",transaction_df["date"].dt.date)

In [16]:
#ahora es inutil la columna "date" ya que tenemos esa misma data, pero en dos columnas especificas par evita duplicidad podemos borrarla
#the dat column is useless knwo that we have the data but in two especific columns so to avoid duplicity we'll drop ot
transaction_df = transaction_df.drop(columns=["date"])

In [ ]:
#just as my senior auditor told me we trasnform the cards into strings

In [18]:
credit_card_df
transaction_df["card"]
#credit_card_df["card"]

0          3561954487988605
1          5135837688671496
2           213193946980303
3          4263694062533017
4             4498002758300
               ...
3495    4723783028106084756
3496    4165305432349489280
3497       5361779664174555
3498       4188164051171486
3499    4723783028106084756
Name: card, Length: 3500, dtype: int64

In [19]:
from datetime import time

In [20]:
transaction_df.loc

In [21]:
SixToEighTransacs = transaction_df.loc[(transaction_df["hour"]<=time(8,0,0)) & (transaction_df["hour"]>=time(6,0,0))]

In [22]:
SixToEighTransacs["amount"].describe()

count     301.000000
mean       54.443455
std       255.015171
min         0.560000
25%         3.610000
50%        10.370000
75%        14.940000
max      2001.000000
Name: amount, dtype: float64

In [28]:
suspiciusTransac = SixToEighTransacs.loc[(SixToEighTransacs["amount"]<2)]

In [35]:
suspiciusTransac.groupby(["id_merchant"])["id_merchant"].count().sort_values(ascending=False)

id_merchant
12     2
48     2
82     2
89     2
114    2
5      1
21     1
30     1
15     1
23     1
3      1
62     1
60     1
50     1
64     1
85     1
98     1
102    1
117    1
119    1
121    1
123    1
126    1
141    1
145    1
147    1
149    1
Name: id_merchant, dtype: int64

In [ ]:
suspiciusTransac.groupby(["id_merchant"])["id_merchant"].count().sort_values(ascending=False)

In [37]:
suspiciusTransac.groupby(["card"])["card"].count().sort_values(ascending=False)

card
501879657465           3
30063281385429         3
4743204091443101526    3
344119623920892        2
4644008655884311378    2
584226564303           1
4498002758300          1
503842928916           1
180098539019105        1
4741042733274          1
372414832802279        1
376027549341849        1
3582198969197591       1
4188164051171486       1
3516952396080247       1
3561072557118696       1
4711773125020499       1
4268491956169254       1
4834483169177062       1
5135837688671496       1
5361779664174555       1
5175947111814778       1
5500708021555307       1
4962915017023706562    1
Name: card, dtype: int64